In [0]:
import sqlite3

![alt text](https://github.com/azc5790/hello-world/blob/master/Screen%20Shot%202019-11-20%20at%2012.26.07%20PM.png?raw=true)

In [0]:
connectionToDatabase = sqlite3.connect('ThemeParkData') 
cursor = connectionToDatabase.cursor()

cursor.execute('''drop table IF EXISTS Customer''')
connectionToDatabase.commit()
cursor.execute('''create table Customer (WristbandID real PRIMARY KEY, FName text, LName text, Age real, Gender text)''')
connectionToDatabase.commit()

cursor.execute('''drop table IF EXISTS Ride''')
connectionToDatabase.commit()
cursor.execute('''create table Ride (RideID real PRIMARY KEY, RideName text, Type text, AvgWaitTime real, Duration text, Location text, CustomerPerDay real)''')
connectionToDatabase.commit()

cursor.execute('''drop table IF EXISTS FastPass''')
connectionToDatabase.commit()
cursor.execute('''create table FastPass (FastPassID real PRIMARY KEY, WristbandID real, Time text, RideID real, Ride text, Price real)''')
connectionToDatabase.commit()

cursor.execute('''drop table IF EXISTS Merchandise''')
connectionToDatabase.commit()
cursor.execute('''create table Merchandise (Barcode text PRIMARY KEY, Type text, Character text, Price real, StoreLocation text)''')
connectionToDatabase.commit()

cursor.execute('''drop table IF EXISTS Restaurant''')
connectionToDatabase.commit()
cursor.execute('''create table Restaurant (Name text PRIMARY KEY, TypeOfFood text, Location text, AvgPrice real, TotalSales real)''')
connectionToDatabase.commit()

cursor.execute('''drop table IF EXISTS Show''')
connectionToDatabase.commit()
cursor.execute('''create table Show (ShowTitle text PRIMARY KEY, StartTime real, Duration text, Location text, MainCharacter text)''')
connectionToDatabase.commit()

cursor.execute('''drop table IF EXISTS Purchases''')
connectionToDatabase.commit()
cursor.execute('''create table Purchases (PurchasesID real PRIMARY KEY, WristbandID real, Price real, Type text, Location text)''')
connectionToDatabase.commit()

In [0]:
#Insert data into each table, be sure to pay attention to if it is text (data must be a string) or real (data must be numbers)
#Customer table
cursor.execute('''insert into Customer values (123432, 'Joe', 'Mama', 32, 'Male');''')
connectionToDatabase.commit()

cursor.execute('''insert into Customer values (123433, 'Meredith', 'Palmer', 56, 'Female');''')
connectionToDatabase.commit()

cursor.execute('''insert into Customer values (123434, 'Suzie', 'Talksalot', 11, 'Female');''')
connectionToDatabase.commit()

cursor.execute('''insert into Customer values (123435, 'Jimmy', 'Toocoolforschool', 14, 'Male');''')
connectionToDatabase.commit()

cursor.execute('''insert into Customer values (123436, 'Harriet', 'Ubman', 16, 'Female');''')
connectionToDatabase.commit()
#continue like this for each table

In [0]:
#Ride table
#replace data with new stuff
cursor.execute('''insert into Ride values (123549, 'Tower of Terror', 'Drop Tower', 47, '5:20', 'Hollywood Studios', 10789);''')
connectionToDatabase.commit()

cursor.execute('''insert into Ride values (489757, 'Rock n Roller Coaster', 'Steel Launch', 63, '1:03', 'Hollywood Studios', 11675);''')
connectionToDatabase.commit()

cursor.execute('''insert into Ride values (9385729, 'Big Thunder Mountain Railroad', 'Mine Train', 35, '2:37', 'Magic Kingdom', 7896);''')
connectionToDatabase.commit()

cursor.execute('''insert into Ride values (2947590, 'Expedition Everest', 'Steel', 77, '3:04', 'Animal Kingdom', 10435);''')
connectionToDatabase.commit()

cursor.execute('''insert into Ride values (3948394, 'Kali River Rapids', 'Water', 24, '1:46', 'Animal Kingdom', 6781);''')
connectionToDatabase.commit()

In [0]:
#FastPass table
#replace data with new stuff
cursor.execute('''insert into FastPass values (46, 123434, '2:15', 122354, 'Tower of Terror', 15);''')
connectionToDatabase.commit()

cursor.execute('''insert into FastPass values (47, 123434, '4:30', 294759, 'Expedition Everest', 15);''')
connectionToDatabase.commit()

cursor.execute('''insert into FastPass values (49, 123436, '12:45', 482975, 'Rock n Roller Coaster', 10);''')
connectionToDatabase.commit()

cursor.execute('''insert into FastPass values (52, 123435, '10:15', 938572, 'Big Thunder Mountain Railroad', 5);''')
connectionToDatabase.commit()

cursor.execute('''insert into FastPass values (59, 123432, '5:15', 122354, 'Tower of Terror', 15);''')
connectionToDatabase.commit()

In [0]:
#Merchandise table
#replace data with new stuff
cursor.execute('''insert into Merchandise values (1968, 123432, 'Mickey Plush', 30, 'Magic Kingdom');''')
connectionToDatabase.commit()
 
cursor.execute('''insert into Merchandise values (1889, 123433, 'Tangled Towel', 35, 'Epcot');''')
connectionToDatabase.commit()
 
cursor.execute('''insert into Merchandise values (1879, 123434, 'Mickey Mouse Ears', 28, 'Epcot');''')
connectionToDatabase.commit()
 
cursor.execute('''insert into Merchandise values (1522, 123436, 'Frozen Towel', 33, 'Disneyland');''')
connectionToDatabase.commit()
 
cursor.execute('''insert into Merchandise values (1970, 123435, 'Frozen Costume', 54, 'Magic Kingdom');''')
connectionToDatabase.commit()

In [0]:
#Restaurant table
cursor.execute('''insert into Restaurant values ('Tonys Town Square Restaurant', 'Italian', 'Magic Kingdom', 78, 30389);''')
connectionToDatabase.commit()
 
cursor.execute('''insert into Restaurant values ('Coral Reef Restaurant', 'Seafood', 'Epcot', 85, 50384);''')
connectionToDatabase.commit()
 
cursor.execute('''insert into Restaurant values ('Le Cellier Steakhouse', 'Steak', 'Epcot', 185, 77193);''')
connectionToDatabase.commit()
 
cursor.execute('''insert into Restaurant values ('Bubba Gump Shrimp Co.', 'Seafood', 'Animal Kingdom', 61, 29017);''')
connectionToDatabase.commit()
 
cursor.execute('''insert into Restaurant values ('Dockside Diner', 'Takeout', 'Hollywood Studios', 59, 33983);''')
connectionToDatabase.commit()

In [0]:
#Show table
#replace data with new stuff
cursor.execute('''insert into Show values ('Mickey All Around the World', '8:30', '2:00', Epcot, 'Mickey');''')
connectionToDatabase.commit()

cursor.execute('''insert into Show values ('Beauty and the Beast', '2:10', '1:00', Magic Kingdom, 'Bella');''')
connectionToDatabase.commit()

cursor.execute('''insert into Show values ('Sleeping Beauty', '3:15', '45', Disney World Resort, 'Aurora');''')
connectionToDatabase.commit()
 
cursor.execute('''insert into Show values ('Fantasmic', '7:45', '1:20', Disney Springs, 'Mickey Mouse and Friends');''')
connectionToDatabase.commit()
 
cursor.execute('''insert into Show values ('Jingle Bell Jingle BAM', '9:00', '1:15', Hollywood Studios, 'Mickey Mouse');''')
connectionToDatabase.commit()

OperationalError: ignored

In [0]:
#Purchases table
#replace data with new stuff
cursor.execute('''insert into Purchases values (14589, 123432, 16.26, 'Clothing', 'Mouse Gear');''')
connectionToDatabase.commit()

cursor.execute('''insert into Purchases values (17923, 123433, 66.78, 'Souvenir', 'Gateway Gifts');''' )
connectionToDatabase.commit()

cursor.execute('''insert into Purchases values (78345, 123434, 82.45, 'Food', 'Dockside Diner');''' )
connectionToDatabase.commit()

cursor.execute('''insert into Purchases values (31345, 123436, 140.67, 'Food', 'Coral Reef Restaurant');''' )
connectionToDatabase.commit()

cursor.execute('''insert into Purchases values (66783, 123435, 93.85, 'Clothing', 'SeaBase Gift Shop');''' )
connectionToDatabase.commit()

In [0]:
#Queries go here

**What is the average wait time for the top 5 rides?**

In [0]:
cursor.execute('''SELECT RideName, SUM(Duration) FROM Ride GROUP BY RideName''')
for row in cursor.fetchall():
  print (row)


This question is important because it shows out of the most popular rides which of them have the longest wait times and which have the shortest wait times. By showing the average wait times for the top 5 rides we are able to see how long it normally takes a person to wait for one of the top rides at the park. Out of the top 5 rides we are able to see that if a ride has a longer wait time then it is more popular than rides with a shorter wait time.

**What type of restaurant generates the most sales revenue?**

In [0]:
cursor.execute('''SELECT TypeOfFood, SUM(TotalSales) FROM Restaurant GROUP BY TypeOfFood ORDER BY SUM(TotalSales) DESC;''')
for row in cursor.fetchall():
  print (row)

This question is extremely important in determining the most profitable types of restaurant located at the parks. By looking at how much money each type of restaurant makes shows what restaurants park goers are actively visiting. This shows what types of restaurants should be added into new parks and what restaurants might need to be removed from old parks.

**What merchandise is the most expensive?**

In [0]:
cursor.execute('''SELECT Character FROM Merchandise ORDER BY Price DESC''')
for row in cursor.fetchall():
  print(row)

('Frozen Costume',)
('Tangled Towel',)
('Frozen Towel',)
('Mickey Plush',)
('Mickey Mouse Ears',)

This question is important because it allows the park to see which item cost the most and which items cost the least. By sorting the items by price from most expensive to least expensive, the park can keep track of how much an item is and whether they need to adjust the price or not. If the park sees that one item is not being bought as much they can just check to see whether the price is too high compared to similar items.